Revit 2026 API

# ElementCanBeHidden Method

---

Indicates if the element can be hidden in the view.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool CanBeHidden(
	View pView
)
```
```vb
Public Function CanBeHidden (
	pView As View
) As Boolean
```
```cpp
public:
bool CanBeHidden(
	View^ pView
)
```
```fsharp
member CanBeHidden :
        pView : View -> bool
```

#### Parameters

pView View

#### Return Value

BooleanIf the element is not permitted to be hidden, false is returned.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when argument is . |

See discussion for some types of elements which may not be hidden. Note: elements in families can only be hidden temporarily.

#### Reference

Element Class

Autodesk.Revit.DB Namespace